tutorials/incompressibleVoF/floatingObject/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultValues
{
    alpha.water 0;
}

zones
{
    water
    {
        type        box;
        zoneType    cell;

        box         (-100 -100 -100) (100 100 0.5368);

        values
        {
            alpha.water 1;
        }
    }

    bump
    {
        type        box;
        zoneType    cell;

        box         (0.7 0.8 -100) (100 100 0.651);

        values
        {
            alpha.water 1;
        }
    }
}

// ************************************************************************* //
